v8/pimpleFoam/0/_unused/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
640
(
256.489
252.886
249.32
245.791
242.298
238.843
235.425
232.045
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
256.489
252.886
249.32
245.791
242.298
238.843
235.425
232.045
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
