v8/pimpleFoam/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 20;

boundaryField
{
    inlet
  
    {
        type            fixedValue;
        value           uniform 0.0122474487139;
    }
 



    outlet
    {
        type            zeroGradient;
    }



    upperWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    lowerWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    wall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    back
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    front
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    left
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
